app/controllers/navermains_controller.rb

	def mypage
		 @posts = Post.all
---
SELECT "posts".* FROM "posts"

	def gym
		 @posts = Post.all
---
SELECT "posts".* FROM "posts"

	def cookie
		@posts = Post.all
---
SELECT "posts".* FROM "posts"

	def list
		@webtoons = Webtoon.all
		@episodes = Episode.all
---
SELECT "webtoons".* FROM "webtoons"
SELECT "episodes".* FROM "episodes"

	def content
		@episodes = Episode.all
		@webtoons = Webtoon.all
---
SELECT "episodes".* FROM "episodes"
SELECT "webtoons".* FROM "webtoons"

	def create
		 division1 = params[:division1]
		 division2 = params[:division2]
		 division3 = params[:division3]
		 title = params[:title]
		 writer = params[:writer]
		 cookie = params[:cookie]
		 Post.create(division1: division1,division2: division2, division3: division3, title: title, writer: writer, cookie: cookie)
---
INSERT INTO "posts" ("division1", "division2", "division3", "title", "writer", "cookie", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"