app/views/navermains/gym.html.erb

SELECT "posts".* FROM "posts"
---
					<script type="application/javascript">
						jQuery('#deleteBookmark').click(function () {
							var checkedCount = 0;
							var idnoinfos = jQuery('._titleNoInfos');
							var titleNoInfos = [];

							for (var i = 0; i < idnoinfos.length; i++) {
								if (idnoinfos[i].checked) {
									checkedCount = checkedCount + 1;
									titleNoInfos.push(idnoinfos[i].value);
								}
							}

							if (checkedCount == 0) {
								alert('삭제할 작품을 선택해 주세요');
								return false;
							}

							jQuery.ajaxSettings.traditional = true;

							jQuery.ajax({
								method: 'POST',