app/views/navermains/mypage.html.erb


						jQuery('#deleteFavorite').click(function () {
							var checkedCount = 0;
							var ids = jQuery('._titleIds');
							var titleIds = [];

							for (i = 0; i < ids.length; i++) {
								if (ids[i].checked) {
									checkedCount = checkedCount + 1;
									titleIds.push(ids[i].value);
								}
							}

							if (checkedCount == 0) {
								alert('삭제할 작품을 선택해 주세요');
								return false;
							}

							jQuery.ajaxSettings.traditional = true;
							jQuery.ajax({
								method: 'POST',
								url: '/mypage/favoriteDelete',
---
SELECT "posts".* FROM "posts"